Backrooms/src/Documents/ЗакрытиеАудитории/ЗакрытиеАудитории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеАудитории</name>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.ЗданияОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеНаМероприятиях</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.Мероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Backrooms/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщедоступнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокУчастников</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределения</name>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Documents/ЗакрытиеАудитории/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КонецЗакрытияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачалоЗакрытияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура АудиторияПриИзмененииНаСервере()
	Объект.ИспользованиеНаМероприятиях.Очистить();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МероприятияРаспределения.Ссылка КАК Мероприятие,
		|	МероприятияРаспределения.ВремяНачала КАК ВремяНачала,
		|	МероприятияРаспределения.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Справочник.Мероприятия.Распределения КАК МероприятияРаспределения
		|ГДЕ
		|	МероприятияРаспределения.ВремяНачала >= &ВремяНачала
		|	И МероприятияРаспределения.ВремяОкончания <= &ВремяОкончания
		|	И МероприятияРаспределения.Аудитория = &Аудитория";
	
	Запрос.УстановитьПараметр("ВремяНачала", Объект.НачалоЗакрытия);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.КонецЗакрытия);
		Запрос.УстановитьПараметр("Аудитория", Объект.Аудитория);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ИспользованиеНаМероприятиях.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура АудиторияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
КонецПроцедуры
